jankaluza/qsimkit/CPU/Variants/msp430x16x.cpp
#define TA0CCTL0_ 0x0162
#endif
#ifndef MC_UPTO_CCR0
#define MC_UPTO_CCR0 MC_1
#endif
#ifndef TBSSEL0
#define TBSSEL0 0x0100
#endif
#ifndef TBSSEL1
#define TBSSEL1 0x0200
#endif
#ifndef TBSSEL2
#define TBSSEL2 0x0400
#endif
#ifndef TA0CCTL1_
#define TA0CCTL1_ 0x0164
#endif
#ifndef CAREF_0
#define CAREF_0 0x00
#endif
#ifndef CAREF_1
#define CAREF_1 0x10
#endif
#ifndef CAREF_2
#define CAREF_2 0x20
#endif
#ifndef CAREF_3
#define CAREF_3 0x30
#endif
#ifndef __IOMACROS_H_
#define __IOMACROS_H_ 
#endif
#ifndef TA0CCTL2_
#define TA0CCTL2_ 0x0166
#endif
#ifndef U0CTL_
#define U0CTL_ 0x0070
#endif
#ifndef __msp430_headers_common_h
#define __msp430_headers_common_h 
#endif
#ifndef SHT1_DIV768
#define SHT1_DIV768 SHT1_11
#endif
#ifndef UCTL_
#define UCTL_ 0x0070
#endif
#ifndef SHT1_DIV1024
#define SHT1_DIV1024 SHT1_12
#endif
#ifndef P4IN_
#define P4IN_ 0x001C
#endif
#ifndef VLDOFF
#define VLDOFF 0x00
#endif
#ifndef CARSEL
#define CARSEL 0x40
#endif
#ifndef SREF_VREF_AVSS
#define SREF_VREF_AVSS SREF_1
#endif
#ifndef ADC12_VECTOR
#define ADC12_VECTOR 14
#endif
#ifndef ADC12TOVIE
#define ADC12TOVIE 0x0004
#endif
#ifndef UCTL_0_
#define UCTL_0_ 0x0070
#endif
#ifndef OAIE
#define OAIE 0x04
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1
#endif
#ifndef TACCR2
#define TACCR2 TA0CCR2
#endif
#ifndef UCTL_1_
#define UCTL_1_ 0x0078
#endif
#ifndef INCH_10
#define INCH_10 10
#endif
#ifndef INCH_11
#define INCH_11 11
#endif
#ifndef INCH_12
#define INCH_12 12
#endif
#ifndef INCH_13
#define INCH_13 13
#endif
#ifndef INCH_14
#define INCH_14 14
#endif
#ifndef INCH_15
#define INCH_15 15
#endif
#ifndef SUMEXT_
#define SUMEXT_ 0x013E
#endif
#ifndef TXRDYIFG
#define TXRDYIFG 0x20
#endif
#ifndef P1OUT_
#define P1OUT_ 0x0021
#endif
#ifndef ALIE
#define ALIE 0x01
#endif
#ifndef DMACTL0_
#define DMACTL0_ 0x0122
#endif
#ifndef OP2_
#define OP2_ 0x0138
#endif
#ifndef __DEC64_EPSILON__
#define __DEC64_EPSILON__ 1E-15DD
#endif
#ifndef DMACTL1_
#define DMACTL1_ 0x0124
#endif
#ifndef USART0RX_VECTOR
#define USART0RX_VECTOR 18
#endif
#ifndef I2CSSEL_UCLK
#define I2CSSEL_UCLK I2CSSEL_0
#endif
#ifndef SYNC
#define SYNC 0x04
#endif
#ifndef P1SEL_
#define P1SEL_ 0x0026
#endif
#ifndef OUT
#define OUT 0x0004
#endif
#ifndef CM_POS
#define CM_POS CM_1
#endif
#ifndef SHT1_DIV512
#define SHT1_DIV512 SHT1_10
#endif
#ifndef ADC12SSEL_ADC12OSC
#define ADC12SSEL_ADC12OSC ADC12SSEL_0
#endif
#ifndef __MSP430_HAS_UART1__
#define __MSP430_HAS_UART1__ 
#endif
#ifndef FSSEL_SMCLK
#define FSSEL_SMCLK FSSEL_2
#endif
#ifndef TASSEL_SMCLK
#define TASSEL_SMCLK TASSEL_2
#endif
#ifndef __SIZE_TYPE__
#define __SIZE_TYPE__ unsigned int
#endif
#ifndef __MSP430_HAS_PORT5__
#define __MSP430_HAS_PORT5__ 
#endif
#ifndef UBR00_
#define UBR00_ 0x0074
#endif
#ifndef TBCLR
#define TBCLR 0x0004
#endif
#ifndef DMA1TSEL0
#define DMA1TSEL0 0x0010
#endif
#ifndef DMA1TSEL1
#define DMA1TSEL1 0x0020
#endif
#ifndef DMA1TSEL2
#define DMA1TSEL2 0x0040
#endif
#ifndef UBR01_
#define UBR01_ 0x007C
#endif
#ifndef U0TCTL_
#define U0TCTL_ 0x0071
#endif
#ifndef UBR0_0_
#define UBR0_0_ 0x0074
#endif
#ifndef ADC12SC
#define ADC12SC 0x0001
#endif
#ifndef SSEL_SMCLK
#define SSEL_SMCLK SSEL_2
#endif
#ifndef LPM0
#define LPM0 CPUOFF
#endif
#ifndef LPM1
#define LPM1 SCG0+CPUOFF
#endif
#ifndef LPM2
#define LPM2 SCG1+CPUOFF
#endif
#ifndef LPM3
#define LPM3 SCG1+SCG0+CPUOFF
#endif
#ifndef LPM4
#define LPM4 SCG1+SCG0+OSCOFF+CPUOFF
#endif
#ifndef UBR0_1_
#define UBR0_1_ 0x007C
#endif
#ifndef TBCCR0_
#define TBCCR0_ 0x0192
#endif
#ifndef TBIE
#define TBIE 0x0002
#endif
#ifndef I2CTCTL_
#define I2CTCTL_ 0x0071
#endif
#ifndef SELM_LFXTCLK
#define SELM_LFXTCLK SELM_3
#endif
#ifndef __FLT_RADIX__
#define __FLT_RADIX__ 2
#endif
#ifndef DMA1DA_
#define DMA1DA_ 0x01EC
#endif
#ifndef TIMERB0_VECTOR
#define TIMERB0_VECTOR 26
#endif
#ifndef __LDBL_EPSILON__
#define __LDBL_EPSILON__ 1.19209290e-7L
#endif
#ifndef ADC12MEM2_
#define ADC12MEM2_ 0x0144
#endif
#ifndef OUTMOD_RESET
#define OUTMOD_RESET OUTMOD_5
#endif
#ifndef INCH_A1
#define INCH_A1 1
#endif
#ifndef INCH_A2
#define INCH_A2 2
#endif
#ifndef INCH_A3
#define INCH_A3 3
#endif
#ifndef INCH_A4
#define INCH_A4 4
#endif
#ifndef INCH_A5
#define INCH_A5 5
#endif
#ifndef INCH_A6
#define INCH_A6 6
#endif
#ifndef SHP
#define SHP 0x0200
#endif
#ifndef ACCVIFG
#define ACCVIFG 0x0004
#endif
#ifndef __msp430_headers_clock_h
#define __msp430_headers_clock_h 
#endif
#ifndef TACTL
#define TACTL TA0CTL
#endif
#ifndef CM_NEG
#define CM_NEG CM_2
#endif
#ifndef __SIZEOF_PTRDIFF_T__
#define __SIZEOF_PTRDIFF_T__ 4
#endif
#ifndef FXKEY
#define FXKEY 0x3300
#endif
#ifndef I2CBB
#define I2CBB 0x01
#endif
#ifndef SCS
#define SCS 0x0800
#endif
#ifndef REFON
#define REFON 0x0020
#endif
#ifndef PORON
#define PORON 0x08
#endif
#ifndef TBR_
#define TBR_ 0x0190
#endif
#ifndef MOD0
#define MOD0 0x01
#endif
#ifndef MOD1
#define MOD1 0x02
#endif
#ifndef MOD2
#define MOD2 0x04
#endif
#ifndef MOD3
#define MOD3 0x08
#endif
#ifndef MOD4
#define MOD4 0x10
#endif
#ifndef SPB
#define SPB 0x20
#endif
#ifndef I2CEN
#define I2CEN 0x01
#endif
#ifndef __DEC32_SUBNORMAL_MIN__
#define __DEC32_SUBNORMAL_MIN__ 0.000001E-95DF
#endif
#ifndef SREF_VEREF_VEREF
#define SREF_VEREF_VEREF SREF_6
#endif
#ifndef NMI_VECTOR
#define NMI_VECTOR 28
#endif
#ifndef TAIV_CCR1
#define TAIV_CCR1 0x02
#endif
#ifndef I2CIV_RXRDY
#define I2CIV_RXRDY 0x0A
#endif
#ifndef SREF_VREF_VEREF
#define SREF_VREF_VEREF SREF_5
#endif
#ifndef __MSP430F110__
#define __MSP430F110__ 1
#endif
#ifndef STC
#define STC 0x02
#endif
#ifndef __FLT_HAS_QUIET_NAN__
#define __FLT_HAS_QUIET_NAN__ 1
#endif
#ifndef __FLT_MAX_10_EXP__
#define __FLT_MAX_10_EXP__ 38
#endif
#ifndef SHT0_DIV8
#define SHT0_DIV8 SHT0_1
#endif
#ifndef IE1_
#define IE1_ 0x0000
#endif
#ifndef SHT0_DIV128
#define SHT0_DIV128 SHT0_6
#endif
#ifndef __LONG_MAX__
#define __LONG_MAX__ 2147483647L
#endif
#ifndef __DEC128_SUBNORMAL_MIN__
#define __DEC128_SUBNORMAL_MIN__ 0.000000000000000000000000000000001E-6143DL
#endif
#ifndef __FLT_HAS_INFINITY__
#define __FLT_HAS_INFINITY__ 1
#endif
#ifndef TASSEL_INCLK
#define TASSEL_INCLK TASSEL_3
#endif
#ifndef U0TXBUF_
#define U0TXBUF_ 0x0077
#endif
#ifndef __DEC64_MAX__
#define __DEC64_MAX__ 9.999999999999999E384DD
#endif
#ifndef TIMERA1_VECTOR
#define TIMERA1_VECTOR 10
#endif
#ifndef __CHAR16_TYPE__
#define __CHAR16_TYPE__ short unsigned int
#endif
#ifndef TA0CCR0_
#define TA0CCR0_ 0x0172
#endif
#ifndef __PRAGMA_REDEFINE_EXTNAME
#define __PRAGMA_REDEFINE_EXTNAME 1
#endif
#ifndef SHS0
#define SHS0 0x0400
#endif
#ifndef TA0CCR1_
#define TA0CCR1_ 0x0174
#endif
#ifndef DMA2TSEL0
#define DMA2TSEL0 0x0100
#endif
#ifndef DMA2TSEL1
#define DMA2TSEL1 0x0200
#endif
#ifndef DMA2TSEL2
#define DMA2TSEL2 0x0400
#endif
#ifndef DMA2TSEL3
#define DMA2TSEL3 0x0800
#endif
#ifndef DMADT0
#define DMADT0 0x1000
#endif
#ifndef DMADT1
#define DMADT1 0x2000
#endif
#ifndef DMADT2
#define DMADT2 0x4000
#endif
#ifndef OUTMOD_OUT
#define OUTMOD_OUT OUTMOD_0
#endif
#ifndef U1TCTL_
#define U1TCTL_ 0x0079
#endif
#ifndef __DEC64_MANT_DIG__
#define __DEC64_MANT_DIG__ 16
#endif
#ifndef TA0CCR2_
#define TA0CCR2_ 0x0176
#endif
#ifndef FSSEL_MCLK
#define FSSEL_MCLK FSSEL_1
#endif
#ifndef SHT0_DIV192
#define SHT0_DIV192 SHT0_7
#endif
#ifndef WDT_VECTOR
#define WDT_VECTOR 20
#endif
#ifndef ROUNDROBIN
#define ROUNDROBIN 0x0002
#endif
#ifndef __DEC32_MAX_EXP__
#define __DEC32_MAX_EXP__ 97
#endif
#ifndef I2CRM
#define I2CRM 0x40
#endif
#ifndef U0IFG
#define U0IFG IFG1
#endif
#ifndef XT2OFF
#define XT2OFF 0x80
#endif
#ifndef SHT0_DIV16
#define SHT0_DIV16 SHT0_2
#endif
#ifndef OUTMOD_SET
#define OUTMOD_SET OUTMOD_1
#endif
#ifndef SHT0_DIV32
#define SHT0_DIV32 SHT0_3
#endif
#ifndef CAREF_VT
#define CAREF_VT CAREF_3
#endif
#ifndef STTIFG
#define STTIFG 0x80
#endif
#ifndef __LDBL_MANT_DIG__
#define __LDBL_MANT_DIG__ 24
#endif
#ifndef CONSEQ_SEQUENCE
#define CONSEQ_SEQUENCE CONSEQ_1
#endif
#ifndef SLSHR0
#define SLSHR0 0x0200
#endif
#ifndef SLSHR1
#define SLSHR1 0x0400
#endif
#ifndef __MSP430_HAS_FLASH__
#define __MSP430_HAS_FLASH__ 
#endif
#ifndef __DBL_HAS_QUIET_NAN__
#define __DBL_HAS_QUIET_NAN__ 1
#endif
#ifndef STTIE
#define STTIE 0x80
#endif
#ifndef SHT0_DIV64
#define SHT0_DIV64 SHT0_4
#endif
#ifndef U0RCTL_
#define U0RCTL_ 0x0072
#endif
#ifndef ADC12CTL1_
#define ADC12CTL1_ 0x01A2
#endif
#ifndef __WCHAR_TYPE__
#define __WCHAR_TYPE__ int
#endif
#ifndef __SIZEOF_FLOAT__
#define __SIZEOF_FLOAT__ 4
#endif
#ifndef UMCTL_0_
#define UMCTL_0_ 0x0073
#endif
#ifndef SHT0_DIV96
#define SHT0_DIV96 SHT0_5
#endif
#ifndef UMCTL_1_
#define UMCTL_1_ 0x007B
#endif
#ifndef WRT
#define WRT 0x0040
#endif
#ifndef CAREF_025
#define CAREF_025 CAREF_1
#endif
#ifndef CONSEQ_SINGLE
#define CONSEQ_SINGLE CONSEQ_0
#endif
#ifndef WDTPW
#define WDTPW 0x5A00
#endif
#ifndef CAREF0
#define CAREF0 0x10
#endif
#ifndef CAREF1
#define CAREF1 0x20
#endif
#ifndef VLD_1_8V
#define VLD_1_8V 0x10
#endif
#ifndef ADC12MEM4_
#define ADC12MEM4_ 0x0148
#endif
#ifndef SHT0_DIV512
#define SHT0_DIV512 SHT0_10
#endif
#ifndef U0ME
#define U0ME ME1
#endif
#ifndef SREF_VEREF_AVSS
#define SREF_VEREF_AVSS SREF_2
#endif
#ifndef __FLT_DIG__
#define __FLT_DIG__ 6
#endif
#ifndef __MSP430_HAS_PORT2__
#define __MSP430_HAS_PORT2__ 
#endif
#ifndef __MSPGCC__
#define __MSPGCC__ 20110706
#endif
#ifndef CAREF_050
#define CAREF_050 CAREF_2
#endif
#ifndef __MSP430_HAS_MPY__
#define __MSP430_HAS_MPY__ 
#endif
#ifndef __INT_MAX__
#define __INT_MAX__ 32767
#endif
#ifndef SHT1_DIV256
#define SHT1_DIV256 SHT1_8
#endif
#ifndef MACS_
#define MACS_ 0x0136
#endif
#ifndef TXBUF0_
#define TXBUF0_ 0x0077
#endif
#ifndef CNTL0
#define CNTL0 0x0800
#endif
#ifndef CNTL1
#define CNTL1 0x1000
#endif
#ifndef TXBUF1_
#define TXBUF1_ 0x007F
#endif
#ifndef UART0RX_VECTOR
#define UART0RX_VECTOR USART0RX_VECTOR
#endif
#ifndef I2CDCTL_
#define I2CDCTL_ 0x0072
#endif
#ifndef BCSCTL2_
#define BCSCTL2_ 0x0058
#endif
#ifndef DAC12RES
#define DAC12RES 0x1000
#endif
#ifndef P2IE_
#define P2IE_ 0x002D
#endif
#ifndef PEV
#define PEV 0x40
#endif
#ifndef __FLT_MAX_EXP__
#define __FLT_MAX_EXP__ 128
#endif
#ifndef I2C
#define I2C 0x20
#endif
#ifndef SHT0_DIV1024
#define SHT0_DIV1024 SHT0_12
#endif
#ifndef SHS_TBCCR0
#define SHS_TBCCR0 SHS_2
#endif
#ifndef SHS_TBCCR1
#define SHS_TBCCR1 SHS_3
#endif
#ifndef __DBL_MANT_DIG__
#define __DBL_MANT_DIG__ 24
#endif
#ifndef RXBUF0_
#define RXBUF0_ 0x0076
#endif
#ifndef __DEC64_MIN__
#define __DEC64_MIN__ 1E-383DD
#endif
#ifndef RXBUF1_
#define RXBUF1_ 0x007E
#endif
#ifndef __WINT_TYPE__
#define __WINT_TYPE__ unsigned int
#endif
#ifndef __SIZEOF_SHORT__
#define __SIZEOF_SHORT__ 2
#endif
#ifndef CAOUT
#define CAOUT 0x01
#endif
#ifndef I2COA_
#define I2COA_ 0x0118
#endif
#ifndef SELM_DCOCLK
#define SELM_DCOCLK SELM_0
#endif
#ifndef ENC
#define ENC 0x0002
#endif
#ifndef __msp430_headers_gpio_h
#define __msp430_headers_gpio_h 
#endif
#ifndef IFG1_
#define IFG1_ 0x0002
#endif
#ifndef CCIFG
#define CCIFG 0x0001
#endif
#ifndef CCIE
#define CCIE 0x0010
#endif
#ifndef MAC_
#define MAC_ 0x0134
#endif
#ifndef EOS
#define EOS 0x80
#endif
#ifndef IFG2_
#define IFG2_ 0x0003
#endif
#ifndef ARDYIE
#define ARDYIE 0x08
#endif
#ifndef ADC12MCTL
#define ADC12MCTL ADC12MCTL_
#endif
#ifndef ADC12BUSY
#define ADC12BUSY 0x0001
#endif
#ifndef __LDBL_MAX_10_EXP__
#define __LDBL_MAX_10_EXP__ 38
#endif
#ifndef P2IN_
#define P2IN_ 0x0028
#endif
#ifndef DMA1SZ_
#define DMA1SZ_ 0x01EE
#endif
#ifndef DAC12GRP
#define DAC12GRP 0x0001
#endif
#ifndef DMA1SA_
#define DMA1SA_ 0x01EA
#endif
#ifndef FE
#define FE 0x80
#endif
#ifndef __MSP430_HAS_SVS__
#define __MSP430_HAS_SVS__ 
#endif
#ifndef ME1_
#define ME1_ 0x0004
#endif
#ifndef __SIZEOF_WCHAR_T__
#define __SIZEOF_WCHAR_T__ 2
#endif
#ifndef CLLD0
#define CLLD0 0x0200
#endif
#ifndef CLLD1
#define CLLD1 0x0400
#endif
#ifndef OUTMOD_SET_RESET
#define OUTMOD_SET_RESET OUTMOD_3
#endif
#ifndef U1RCTL_
#define U1RCTL_ 0x007A
#endif
#ifndef ME2_
#define ME2_ 0x0005
#endif
#ifndef TXRDYIE
#define TXRDYIE 0x20
#endif
#ifndef CONSEQ_REPEAT_SINGLE
#define CONSEQ_REPEAT_SINGLE CONSEQ_2
#endif
#ifndef CONSEQ0
#define CONSEQ0 0x0002
#endif
#ifndef CONSEQ1
#define CONSEQ1 0x0004
#endif
#ifndef OUTMOD_TOGGLE_SET
#define OUTMOD_TOGGLE_SET OUTMOD_6
#endif
#ifndef CCTL0
#define CCTL0 TA0CCTL0
#endif
#ifndef CCTL1
#define CCTL1 TA0CCTL1
#endif
#ifndef CCTL2
#define CCTL2 TA0CCTL2
#endif
#ifndef CCR0
#define CCR0 TA0CCR0
#endif
#ifndef CCR1
#define CCR1 TA0CCR1
#endif
#ifndef CCR2
#define CCR2 TA0CCR2
#endif
#ifndef SHT0_DIV4
#define SHT0_DIV4 SHT0_0
#endif
#ifndef ADC_VECTOR
#define ADC_VECTOR ADC12_VECTOR
#endif
#ifndef MM
#define MM 0x02
#endif
#ifndef RXRDYIE
#define RXRDYIE 0x10
#endif
#ifndef I2CDR_
#define I2CDR_ 0x0076
#endif
#ifndef ID0
#define ID0 0x0040
#endif
#ifndef ID1
#define ID1 0x0080
#endif
#ifndef CCIS0
#define CCIS0 0x1000
#endif
#ifndef CCIS1
#define CCIS1 0x2000
#endif
#ifndef __MSP430_HAS_PORT6__
#define __MSP430_HAS_PORT6__ 
#endif
#ifndef UBR10_
#define UBR10_ 0x0075
#endif
#ifndef TAR
#define TAR TA0R
#endif
#ifndef OE
#define OE 0x20
#endif
#ifndef UBR11_
#define UBR11_ 0x007D
#endif
#ifndef __DEC_EVAL_METHOD__
#define __DEC_EVAL_METHOD__ 2
#endif
#ifndef INCH_VEREF_MINUS
#define INCH_VEREF_MINUS 9
#endif
#ifndef PE
#define PE 0x40
#endif
#ifndef NACKIFG
#define NACKIFG 0x02
#endif
#ifndef WDTTMSEL
#define WDTTMSEL 0x0010
#endif
#ifndef DIVS_DIV1
#define DIVS_DIV1 DIVS_0
#endif
#ifndef DIVS_DIV2
#define DIVS_DIV2 DIVS_1
#endif
#ifndef DIVS_DIV4
#define DIVS_DIV4 DIVS_2
#endif
#ifndef DIVS_DIV8
#define DIVS_DIV8 DIVS_3
#endif
#ifndef TAIE
#define TAIE 0x0002
#endif
#ifndef ERASE
#define ERASE 0x0002
#endif
#ifndef I2CMM_0
#define I2CMM_0 0
#endif
#ifndef XT5V
#define XT5V 0x08
#endif
#ifndef __INTMAX_MAX__
#define __INTMAX_MAX__ 9223372036854775807LL
#endif
#ifndef CONSEQ_REPEAT_SEQUENCE
#define CONSEQ_REPEAT_SEQUENCE CONSEQ_3
#endif
#ifndef __FLT_DENORM_MIN__
#define __FLT_DENORM_MIN__ 1.40129846e-45F
#endif
#ifndef P5IN_
#define P5IN_ 0x0030
#endif
#ifndef UTCTL_
#define UTCTL_ 0x0071
#endif
#ifndef INCH_TEMP
#define INCH_TEMP 10
#endif
#ifndef URCTL0_
#define URCTL0_ 0x0072
#endif
#ifndef I2CSA_
#define I2CSA_ 0x011A
#endif
#ifndef URCTL1_
#define URCTL1_ 0x007A
#endif
#ifndef UCTL0_
#define UCTL0_ 0x0070
#endif
#ifndef I2CSBD
#define I2CSBD 0x08
#endif
#ifndef XA
#define XA 0x10
#endif
#ifndef __CHAR32_TYPE__
#define __CHAR32_TYPE__ unsigned int
#endif
#ifndef UCTL1_
#define UCTL1_ 0x0078
#endif
#ifndef __FLT_MAX__
#define __FLT_MAX__ 3.40282347e+38F
#endif
#ifndef SREF_AVCC_AVSS
#define SREF_AVCC_AVSS SREF_0
#endif
#ifndef TBCLGRP0
#define TBCLGRP0 0x2000
#endif
#ifndef TBCLGRP1
#define TBCLGRP1 0x4000
#endif
#ifndef TAIV_
#define TAIV_ TA0IV_
#endif
#ifndef USART1TX_VECTOR
#define USART1TX_VECTOR 4
#endif
#ifndef __SIZEOF_DOUBLE__
#define __SIZEOF_DOUBLE__ 4
#endif
#ifndef ADC12MEM0_
#define ADC12MEM0_ ADC12MEM_
#endif
#ifndef I2CDRB_
#define I2CDRB_ 0x0076
#endif
#ifndef DMADSTBYTE
#define DMADSTBYTE 0x0080
#endif
#ifndef I2CRXOVR
#define I2CRXOVR 0x02
#endif
#ifndef WDTHOLD
#define WDTHOLD 0x0080
#endif
#ifndef __INTMAX_TYPE__
#define __INTMAX_TYPE__ long long int
#endif
#ifndef ADC12MEM1_
#define ADC12MEM1_ 0x0142
#endif
#ifndef __DEC128_MAX_EXP__
#define __DEC128_MAX_EXP__ 6145
#endif
#ifndef I2CSSEL_SMCLK
#define I2CSSEL_SMCLK I2CSSEL_2
#endif
#ifndef SHR0
#define SHR0 0x2000
#endif
#ifndef SHR1
#define SHR1 0x4000
#endif
#ifndef ADC12MEM3_
#define ADC12MEM3_ 0x0146
#endif
#ifndef SHS1
#define SHS1 0x0800
#endif
#ifndef __GNUC_MINOR__
#define __GNUC_MINOR__ 5
#endif
#ifndef __UINTMAX_MAX__
#define __UINTMAX_MAX__ 18446744073709551615ULL
#endif
#ifndef __DEC32_MANT_DIG__
#define __DEC32_MANT_DIG__ 7
#endif
#ifndef COMPARATORA_VECTOR
#define COMPARATORA_VECTOR 22
#endif
#ifndef ADC12MEM5_
#define ADC12MEM5_ 0x014A
#endif
#ifndef __DBL_MAX_10_EXP__
#define __DBL_MAX_10_EXP__ 38
#endif
#ifndef __MSP430_HAS_TB7__
#define __MSP430_HAS_TB7__ 
#endif
#ifndef __LDBL_DENORM_MIN__
#define __LDBL_DENORM_MIN__ 1.40129846e-45L
#endif
#ifndef ADC12MEM6_
#define ADC12MEM6_ 0x014C
#endif
#ifndef I2CWORD
#define I2CWORD 0x80
#endif
#ifndef ADC12MEM7_
#define ADC12MEM7_ 0x014E
#endif
#ifndef SHT1_DIV4
#define SHT1_DIV4 SHT1_0
#endif
#ifndef TACCTL0_
#define TACCTL0_ TA0CCTL0_
#endif
#ifndef __STDC__
#define __STDC__ 1
#endif
#ifndef MC1
#define MC1 0x0020
#endif
#ifndef __MSP430_HAS_ADC12__
#define __MSP430_HAS_ADC12__ 
#endif
#ifndef ADC12MEM8_
#define ADC12MEM8_ 0x0150
#endif
#ifndef __msp430_have_usart1
#define __msp430_have_usart1 
#endif
#ifndef __PTRDIFF_TYPE__
#define __PTRDIFF_TYPE__ long int
#endif
#ifndef UBR1_0_
#define UBR1_0_ 0x0075
#endif
#ifndef TACCTL1_
#define TACCTL1_ TA0CCTL1_
#endif
#ifndef INCH_0
#define INCH_0 0
#endif
#ifndef INCH_1
#define INCH_1 1
#endif
#ifndef INCH_2
#define INCH_2 2
#endif
#ifndef INCH_3
#define INCH_3 3
#endif
#ifndef INCH_4
#define INCH_4 4
#endif
#ifndef INCH_5
#define INCH_5 5
#endif
#ifndef INCH_6
#define INCH_6 6
#endif
#ifndef INCH_7
#define INCH_7 7
#endif
#ifndef INCH_8
#define INCH_8 8
#endif
#ifndef INCH_9
#define INCH_9 9
#endif
#ifndef TAIV_OVERFLOW
#define TAIV_OVERFLOW 0x0A
#endif
#ifndef P2IES_
#define P2IES_ 0x002C
#endif
#ifndef ADC12MEM9_
#define ADC12MEM9_ 0x0152
#endif
#ifndef UBR1_1_
#define UBR1_1_ 0x007D
#endif
#ifndef TACCTL2_
#define TACCTL2_ TA0CCTL2_
#endif
#ifndef MSP430
#define MSP430 1
#endif
#ifndef DMA2DA_
#define DMA2DA_ 0x01F4
#endif
#ifndef __msp430_headers_compa_h
#define __msp430_headers_compa_h 
#endif
#ifndef __msp430_headers_usart_h
#define __msp430_headers_usart_h 
#endif
#ifndef P6DIR_
#define P6DIR_ 0x0036
#endif
#ifndef TBIV_CCR1
#define TBIV_CCR1 0x02
#endif
#ifndef TBIV_CCR3
#define TBIV_CCR3 0x06
#endif
#ifndef TBIV_CCR4
#define TBIV_CCR4 0x08
#endif
#ifndef TBIV_CCR5
#define TBIV_CCR5 0x0A
#endif
#ifndef TBIV_CCR6
#define TBIV_CCR6 0x0C
#endif
#ifndef __DEC64_SUBNORMAL_MIN__
#define __DEC64_SUBNORMAL_MIN__ 0.000000000000001E-383DD
#endif
#ifndef BCSCTL1_
#define BCSCTL1_ 0x0057
#endif
#ifndef __DEC128_MANT_DIG__
#define __DEC128_MANT_DIG__ 34
#endif
#ifndef __MSP430_CPU__
#define __MSP430_CPU__ 0
#endif
#ifndef I2CSTB
#define I2CSTB 0x04
#endif
#ifndef U1RXBUF_
#define U1RXBUF_ 0x007E
#endif
#ifndef I2CSTP
#define I2CSTP 0x02
#endif
#ifndef I2CSTT
#define I2CSTT 0x01
#endif
#ifndef __SIZEOF_LONG_LONG__
#define __SIZEOF_LONG_LONG__ 8
#endif
#ifndef CM_DISABLE
#define CM_DISABLE CM_0
#endif
#ifndef __LDBL_DIG__
#define __LDBL_DIG__ 6
#endif
#ifndef OSCOFF
#define OSCOFF 0x0020
#endif
#ifndef ENNMI
#define ENNMI 0x0001
#endif
#ifndef __GNUC_GNU_INLINE__
#define __GNUC_GNU_INLINE__ 1
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2
#endif
#ifndef WDTIS0
#define WDTIS0 0x0001
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef INCH_A0
#define INCH_A0 0
#endif
#ifndef BRK
#define BRK 0x10
#endif
#ifndef CAPD0
#define CAPD0 0x01
#endif
#ifndef CAPD1
#define CAPD1 0x02
#endif
#ifndef CAPD2
#define CAPD2 0x04
#endif
#ifndef CAPD3
#define CAPD3 0x08
#endif
#ifndef CAPD4
#define CAPD4 0x10
#endif
#ifndef CAPD5
#define CAPD5 0x20
#endif
#ifndef CAPD6
#define CAPD6 0x40
#endif
#ifndef CAPD7
#define CAPD7 0x80
#endif
#ifndef INCH_A7
#define INCH_A7 7
#endif
#ifndef DMAIFG
#define DMAIFG 0x0008
#endif
#ifndef C
#define C 0x0001
#endif
#ifndef N
#define N 0x0004
#endif
#ifndef SHT1_DIV8
#define SHT1_DIV8 SHT1_1
#endif
#ifndef CAPD_
#define CAPD_ 0x005B
#endif
#ifndef V
#define V 0x0100
#endif
#ifndef Z
#define Z 0x0002
#endif
#include "CPU/Variants/Variant.h"
#include "CPU/Variants/VariantManager.h"

